Extensions/ИнтеграцияGreenApi/DataProcessors/iga_ChatBot.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>iga_ChatBot</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IdInstance</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ApiToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>webhookUrl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалОтправкиСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтмечатьВходящиеСообщенияПрочитанными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьВходящиеСообщенияИФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьВходящиеУведомления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьСтатусыОтправленныхСообщений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьУведомленииОСостоянииТелефона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьУведомленияОСостоянииАккаунта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>apiUrl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>mediaUrl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыставлитьСтатусВСети</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательВебХука</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольВебХука</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортВебХука</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ИсторияСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ИсторияСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоВходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрочитаноОператором</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстЦитирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторЦитирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременнаяМетка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IDЦитируемогоСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПрикрепленныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПрикрепленныеФайлы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипМедиа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_ТипыМедиаФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыОбработкиФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>URLЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КартинкаФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>IDСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_КонтрольНовыхСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_КонтрольНовыхСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВременнаяМеткаНовыхСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ОчередьРаспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ОчередьРаспределения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКонцаБронирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПродлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейАктивности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследнимПисалОператор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсобыйЧат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПоследниеСообщенияЧатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПоследниеСообщенияЧатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЭтоВходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоВходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_ТипыМедиаФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_ТипыМедиаФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Картинка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аудио</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Видео</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГолосовоеСообщение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_СтатусыОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_СтатусыОчереди</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросСоединения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщениеСБотом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнеОчереди</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/DataProcessors/iga_ChatBot/Forms/ФормаПросмотраЧата/Ext/Form/Module.bsl
&НаКлиенте
Перем КэшСообщений;

&НаКлиенте
Перем КэшКонтента;

&НаСервереБезКонтекста
Функция СформироватьHTMLДиалогаНаСервере(ЧатСсылка, КэшКонтента, УникальныйИдентификаторФормы)
    Возврат iga_РаспределениеСервер.СформироватьHTMLДиалога(ЧатСсылка, КэшКонтента, УникальныйИдентификаторФормы, "");
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КэшСообщений = Новый Соответствие;
	КэшКонтента = Новый Соответствие;
	
	Результат = СформироватьHTMLДиалогаНаСервере(Неопределено, КэшКонтента, УникальныйИдентификатор);
	ТекстДиалогаHTML = Результат.HTML;
	ТекущаяВременнаяМетка = Результат.ТекущаяВременнаяМетка;
	
	ПодключитьОбработчикОжидания("ОбновитьОкноДиалога", 0.2, Истина);
	
    ПодключитьОбработчикОжидания("ПроверитьНовыеСообщения", 5);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНовыеСообщенияДляИнтерфейса(ЧатСсылка, ТекущаяВременнаяМетка)
    СписокНовых = Новый Массив;
    
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	История.Текст КАК Текст,
                   |	История.ДатаСообщения КАК Дата,
                   |	История.ЭтоВходящее КАК ЭтоВходящее,
                   |	ЕСТЬNULL(История.Оператор.Наименование, """") КАК ОператорИмя,
                   |	История.ТекстЦитирования КАК ТекстЦитирования,
                   |	История.АвторЦитирования КАК АвторЦитирования,
                   |	История.IDСообщения КАК IDСообщения,
                   |	История.IDЦитируемогоСообщения КАК IDЦитируемогоСообщения,
                   |	История.ВременнаяМетка КАК ВременнаяМетка,
                   |	История.ЕстьФайл КАК ЕстьФайл,
                   |	iga_ПрикрепленныеФайлы.ДанныеФайла КАК ДанныеФайла,
                   |	iga_ПрикрепленныеФайлы.ПутьКФайлу КАК ПутьКФайлу,
                   |	iga_ПрикрепленныеФайлы.ТипМедиа КАК ТипМедиа,
                   |	iga_ПрикрепленныеФайлы.Статус КАК Статус,
                   |	iga_ПрикрепленныеФайлы.ТекстОшибки КАК ТекстОшибки,
                   |	iga_ПрикрепленныеФайлы.URLЗагрузки КАК URLЗагрузки,
                   |	iga_ПрикрепленныеФайлы.КартинкаФайла КАК КартинкаФайла,
                   |	iga_ПрикрепленныеФайлы.РазмерФайла КАК РазмерФайла,
                   |	iga_ПрикрепленныеФайлы.ИмяФайла КАК ИмяФайла
                   |ИЗ
                   |	РегистрСведений.iga_ИсторияСообщений КАК История
                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ПрикрепленныеФайлы КАК iga_ПрикрепленныеФайлы
                   |		ПО История.IDСообщения = iga_ПрикрепленныеФайлы.IDСообщения
                   |ГДЕ
                   |	История.Чат = &Чат
                   |	И История.ВременнаяМетка > &ТекущаяВременнаяМетка
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |	ВременнаяМетка";
    Запрос.УстановитьПараметр("ТекущаяВременнаяМетка", ТекущаяВременнаяМетка);
    Запрос.УстановитьПараметр("Чат", ЧатСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
    Выборка = РезультатЗапроса.Выбрать();
    Пока Выборка.Следующий() Цикл
        Стр = Новый Структура;
		Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
			Стр.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
		КонецЦикла;
		
        СписокНовых.Добавить(Стр);
    КонецЦикла;
    
    Возврат СписокНовых;
КонецФункции

&НаСервереБезКонтекста
Процедура ПочиститьКэшКонтентаНаСервере(АдресаУдаляемыхДанных)
	
	Для Каждого Адрес Из АдресаУдаляемыхДанных Цикл
		УдалитьИзВременногоХранилища(Адрес);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПочиститьКэшКонтента()
	
	АдресаУдаляемыхДанных = Новый Массив;
	
	ЕстьУдаляемыеДанные = Ложь;
	
	УдаляемыеКлючи = Новый Массив;
	
	ПустыеЧаты = Новый Массив;
	
	Для Каждого КэшЧата Из КэшКонтента Цикл
		
		Если Не ТипЗнч(КэшЧата.Значение) = Тип("Соответствие") Тогда
			Продолжить;
		КонецЕсли;
		
		УдаляемыеКлючи.Очистить();
		
		Для Каждого КэшСообщения Из КэшЧата.Значение Цикл
			КоличествоМинут = iga_ОбщегоНазначенияКлиентСервер.РазностьДат(КэшСообщения.Значение.ДатаКэша, ТекущаяДата(), "МИНУТА");
			Если КоличествоМинут > 30 Тогда
				АдресаУдаляемыхДанных.Добавить(КэшСообщения.Значение.Адрес);
				УдаляемыеКлючи.Добавить(КэшСообщения.Ключ);
				ЕстьУдаляемыеДанные = Истина;
			КонецЕсли;
		КонецЦикла;
		Для Каждого КлючКэша Из УдаляемыеКлючи Цикл
			КэшЧата.Значение.Удалить(КлючКэша)
		КонецЦикла;
		
		Если КэшЧата.Значение.Количество() = 0 Тогда
			ПустыеЧаты.Добавить(КэшЧата.Ключ);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого КлючЧата Из ПустыеЧаты Цикл
		КэшКонтента.Удалить(КлючЧата);
	КонецЦикла;
	
	Если ЕстьУдаляемыеДанные Тогда
		ПочиститьКэшКонтентаНаСервере(АдресаУдаляемыхДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСообщениеВИнтерфейс(Сообщение)
	
    ТекстЦитаты = "";
    АвторЦитаты = "";
    
	Если ЗначениеЗаполнено(Сообщение.IDЦитируемогоСообщения) Тогда
        ДанныеЦитаты = КэшСообщений.Получить(Сообщение.IDЦитируемогоСообщения);
        Если ДанныеЦитаты <> Неопределено Тогда
            ТекстЦитаты = ДанныеЦитаты.Текст;
            АвторЦитаты = ДанныеЦитаты.Автор;
        КонецЕсли;
    КонецЕсли;
    
    ДанныеТекущего = Новый Структура("ID, Текст, Автор", Сообщение.IDСообщения, Сообщение.Текст, ?(Сообщение.ЭтоВходящее, "Клиент", "Вы"));
    КэшСообщений.Вставить(Сообщение.IDСообщения, ДанныеТекущего);
	
	
	ТекстСообщения = Сообщение.Текст;
    ПараметрыJS = Новый Структура;
    ПараметрыJS.Вставить("id",           Сообщение.IDСообщения);
    ПараметрыJS.Вставить("isIncoming",   Сообщение.ЭтоВходящее);
    ПараметрыJS.Вставить("time",         Формат(Сообщение.Дата, "ДЛФ=DT"));
    ПараметрыJS.Вставить("quoteText",    ТекстЦитаты);
	ПараметрыJS.Вставить("quoteAuthor",  АвторЦитаты);
	ПараметрыJS.Вставить("operatorName", Сообщение.ОператорИмя);
	Если Сообщение.Свойство("ЕстьФайл") И Сообщение.ЕстьФайл Тогда
		ПараметрыJS.Вставить("hasFile",      Сообщение.ЕстьФайл);
		ПараметрыJS.Вставить("fileStatus",   Строка(Сообщение.Статус));
		ПараметрыJS.Вставить("fileName",     Сообщение.ИмяФайла);
		ПараметрыJS.Вставить("fileSize",     Сообщение.РазмерФайла);
		ПараметрыJS.Вставить("thumbnail",    Сообщение.КартинкаФайла);
		КлассИконки = "icon-save";
		Если Сообщение.ТипМедиа = ПредопределенноеЗначение("Перечисление.iga_ТипыМедиаФайлов.Картинка") Тогда
			КлассИконки = "icon-zoom";
			ТекстСообщения = ?(ТекстСообщения = "", "Изображение", ТекстСообщения);
		ИначеЕсли Сообщение.ТипМедиа = ПредопределенноеЗначение("Перечисление.iga_ТипыМедиаФайлов.Видео") 
			ИЛИ Сообщение.ТипМедиа = ПредопределенноеЗначение("Перечисление.iga_ТипыМедиаФайлов.Аудио") Тогда
			КлассИконки = "icon-play";
			Если Сообщение.ТипМедиа = ПредопределенноеЗначение("Перечисление.iga_ТипыМедиаФайлов.Видео") Тогда 
				ТекстСообщения = ?(ТекстСообщения = "", "Видеозапись", ТекстСообщения);
			Иначе
				ТекстСообщения = ?(ТекстСообщения = "", "Аудиозапись", ТекстСообщения);
			КонецЕсли;
		Иначе
			ТекстСообщения = ?(ТекстСообщения = "", "Документ", ТекстСообщения);
		КонецЕсли;
		ПараметрыJS.Вставить("iconClass",    КлассИконки);
	Иначе
		ПараметрыJS.Вставить("hasFile",      Ложь);
	КонецЕсли;
    ПараметрыJS.Вставить("text",         ТекстСообщения);
    
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, ПараметрыJS);
    СтрJSON = ЗаписьJSON.Закрыть();
    
    ДокументHTML = Элементы.ТекстДиалогаHTML.Документ;
    Если ДокументHTML <> Неопределено Тогда
        ДокументHTML.defaultView.appendMessage(СтрJSON);
    КонецЕсли;
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьНовыеСообщенияНаСервере(ОбщаяВременнаяМетка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_КонтрольНовыхСообщений.ВременнаяМеткаНовыхСообщений КАК ВременнаяМеткаНовыхСообщений
	               |ИЗ
	               |	РегистрСведений.iga_КонтрольНовыхСообщений КАК iga_КонтрольНовыхСообщений
	               |ГДЕ
	               |	iga_КонтрольНовыхСообщений.ВременнаяМеткаНовыхСообщений > &ОбщаяВременнаяМетка";
	Запрос.УстановитьПараметр("ОбщаяВременнаяМетка", ОбщаяВременнаяМетка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбщаяВременнаяМетка = Выборка.ВременнаяМеткаНовыхСообщений;
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьНовыеСообщения()
	
	ТекущиеДанные = Элементы.СписокНаПодключение.ТекущиеДанные;

	Если ЕстьНовыеСообщенияНаСервере(ОбщаяВременнаяМетка) И Не ТекущиеДанные = Неопределено И Не ТекущиеДанные.Свойство("ГруппировкаСтроки") Тогда
		
		НовыеСообщения = ПолучитьНовыеСообщенияДляИнтерфейса(ТекущиеДанные.Чат, ТекущаяВременнаяМетка);
		
		Для Каждого Сообщение Из НовыеСообщения Цикл
			
			ДобавитьСообщениеВИнтерфейс(Сообщение);
			
			ТекущаяВременнаяМетка = Макс(ТекущаяВременнаяМетка, Сообщение.ВременнаяМетка);
		КонецЦикла;
		
	КонецЕсли;
	
	КоличествоМинутПослеОчисткиКэша = iga_ОбщегоНазначенияКлиентСервер.РазностьДат(ДатаОчисткиКэша, ТекущаяДата(), "МИНУТА");
	
	Если КоличествоМинутПослеОчисткиКэша > 30 Тогда
		ПочиститьКэшКонтента()
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСообщенияПриОткрытии(МассивСообщений)
	
	ДокументHTML = Элементы.ТекстДиалогаHTML.Документ;
	
	Счетчик = 0;
	Для Каждого Сообщение Из МассивСообщений Цикл
        ЗаписьJSON = Новый ЗаписьJSON;
        ЗаписьJSON.УстановитьСтроку();
        ЗаписатьJSON(ЗаписьJSON, Сообщение.ПараметрыJS);
        СтрJSON = ЗаписьJSON.Закрыть();

		ДокументHTML.defaultView.appendMessage(СтрJSON);
	КонецЦикла;
	ДокументHTML.defaultView.scrollEnd();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрочитатьСообщенияНаСервере(ЧатСсылка, КэшСообщений, ИДЧата, АктивныйЧат)
	
	ЕстьНепрочитанные = Ложь;
	Для Каждого ДанныеСообщения Из КэшСообщений Цикл
		Если Не ДанныеСообщения.Значение.ПрочитаноОператором Тогда
			ЕстьНепрочитанные = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьНепрочитанные Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.iga_ИсторияСообщений КАК iga_ИсторияСообщений
	               |ГДЕ
	               |	iga_ИсторияСообщений.Чат = &Чат
	               |	И iga_ИсторияСообщений.IDСообщения В(&IDСообщений)";
	Запрос.УстановитьПараметр("Чат", ЧатСсылка);
	IDСообщений = Новый Массив;
	Для Каждого ДанныеСообщения Из КэшСообщений Цикл
		Если Не ДанныеСообщения.Значение.ПрочитаноОператором Тогда
			IDСообщений.Добавить(ДанныеСообщения.Значение.IDСообщения);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("IDСообщений", IDСообщений);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.iga_ИсторияСообщений.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.ПрочитаноОператором = Истина;
		Запись.Записать();
	КонецЦикла;
	
	Если АктивныйЧат Тогда
		Бот = Обработки.iga_ChatBot.Создать();
		Бот.ИнициализацияОсновныхПараметров();
		Бот.ОтметитьЧатПрочитанным(ИДЧата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОкноДиалога()
	
	Результат = СформироватьHTMLДиалогаНаСервере(ТекущийЧат, КэшКонтента, УникальныйИдентификатор);
	ТекстДиалогаHTML = Результат.HTML;
	ТекущаяВременнаяМетка = Макс(ТекущаяВременнаяМетка, Результат.ТекущаяВременнаяМетка);
	
	Элементы.ТекстДиалогаHTML.Документ.defaultView.clearMessages();
	
	
	ВывестиСообщенияПриОткрытии(Результат.МассивДанных);
	
	
	
	КэшСообщений = Новый Соответствие;
	Для Каждого СтрИзМассива Из Результат.МассивДанных Цикл
		КэшСообщений.Вставить(СтрИзМассива.IDСообщения, СтрИзМассива);
		Если ЗначениеЗаполнено(СтрИзМассива.IDЦитируемогоСообщения) Тогда
			СтруктураЦитируемогоСообщения = iga_ОбщегоНазначенияКлиентСервер.СкопироватьПоляСтруктуры(СтрИзМассива);
			СтруктураЦитируемогоСообщения.Текст = СтрИзМассива.ТекстЦитирования;
			СтруктураЦитируемогоСообщения.Автор = СтрИзМассива.АвторЦитирования;
			СтруктураЦитируемогоСообщения.ПрочитаноОператором = СтрИзМассива.ПрочитаноОператором;
			КэшСообщений.Вставить(СтрИзМассива.IDЦитируемогоСообщения, СтруктураЦитируемогоСообщения);
		КонецЕсли;
	КонецЦикла;
	
	ПрочитатьСообщенияНаСервере(ТекущийЧат, КэшСообщений, ИдЧата, Ложь);
	
	ЦитируемоеСообщениеИд = "";
	
	Элементы.ТекстДиалогаHTML.Документ.defaultView.scrollEnd();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНаПодключениеПриАктивизацииСтроки(Элемент)
	
    ОтключитьОбработчикОжидания("ОбновитьОкноДиалога");
    ПодключитьОбработчикОжидания("ОбновитьОкноДиалога", 0.2, Истина);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПеревестиНаОператораНаСервере(Оператор, Чат)
	
	ЗаписьОжидания = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
	ЗаписьОжидания.Чат = Чат;
	ЗаписьОжидания.Оператор = Оператор;
	ЗаписьОжидания.Прочитать();
	ДатаПоступления = ТекущаяДата();
	Если ЗаписьОжидания.Выбран() Тогда 
		ЗаписьОжидания.Удалить();
		ДатаПоступления = ЗаписьОжидания.ДатаПоследнейАктивности;
	КонецЕсли;
	
	БезОповещения = iga_МетодыРаботыСБотом.ПолучитьЗначениеПараметраОбщения(Чат, "БезОповещения");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ПоследниеСообщенияЧатов.ЭтоВходящее КАК ЭтоВходящее
	               |ИЗ
	               |	РегистрСведений.iga_ПоследниеСообщенияЧатов КАК iga_ПоследниеСообщенияЧатов
	               |ГДЕ
	               |	iga_ПоследниеСообщенияЧатов.Чат = &Чат
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	iga_ПоследниеСообщенияЧатов.ДатаСообщения УБЫВ";
	Запрос.УстановитьПараметр("Чат", Чат);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ВходящееСобщение = Выборка.ЭтоВходящее;
	
	ЗаписьОжидания.Оператор = Оператор;
	ЗаписьОжидания.Чат = Чат;
	ЗаписьОжидания.БезОповещения = БезОповещения;
	ЗаписьОжидания.ДатаПоступления = ДатаПоступления;
	ЗаписьОжидания.ДатаПоследнейАктивности = ТекущаяДата();
	ЗаписьОжидания.ДатаКонцаБронирования = ТекущаяДата();
	ЗаписьОжидания.ПоследнимПисалОператор = Не ВходящееСобщение;
	ЗаписьОжидания.Статус = Перечисления.iga_СтатусыОчереди.ВРаботе;
	ЗаписьОжидания.Записать();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ОчередьРаспределения.Чат КАК Чат,
	               |	iga_ОчередьРаспределения.Оператор КАК Оператор
	               |ИЗ
	               |	РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	               |ГДЕ
	               |	iga_ОчередьРаспределения.Оператор <> &Оператор
	               |	И iga_ОчередьРаспределения.Чат = &Чат";
	Запрос.УстановитьПараметр("Оператор", Оператор);
	Запрос.УстановитьПараметр("Чат", Чат);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьОжидания = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
		ЗаписьОжидания.Чат = Выборка.Чат;
		ЗаписьОжидания.Оператор = Выборка.Оператор;
		ЗаписьОжидания.Удалить();
	КонецЦикла;
	
		
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПеревестиНаОператора(Команда)
	
	Оператор = Ждать ВвестиЗначениеАсинх(, "Выберите оператора", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	
	Если Оператор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = Ждать ВопросАсинх("Передать выбранный чат данному оператору?", 
		РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "Передача другому оператору", КодВозвратаДиалога.Нет);
		
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПеревестиНаОператораНаСервере(Оператор, Элементы.СписокНаПодключение.ТекущиеДанные.Чат);
	
	ПоказатьПредупреждение(, "Чат переведен");
	Элементы.СписокНаПодключение.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗакрытьЧатНаСервере(Чат, Оператор, БезОповещения)
	
	НачатьТранзакцию();
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.iga_ОчередьРаспределения");
	ЭлементБлокировки.УстановитьЗначение("Чат", Чат);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	БлокировкаДанных.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ОчередьРаспределения.Чат КАК Чат,
	               |	iga_ОчередьРаспределения.Оператор КАК Оператор
	               |ИЗ
	               |	РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	               |ГДЕ
	               |	iga_ОчередьРаспределения.Чат = &Чат И Оператор = &Оператор";
	Запрос.УстановитьПараметр("Чат", Чат);
	Запрос.УстановитьПараметр("Оператор", Оператор);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Запись = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
		Запись.Чат = Чат;
		Запись.Оператор = Выборка.Оператор;
		Запись.Статус = Перечисления.iga_СтатусыОчереди.Завершен;
		Запись.Записать();
		
	КонецЕсли;        
	
	iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(Чат, "БезОповещения", БезОповещения);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗакрытьЧат(Команда)
	
		
	СписокМеню = Новый СписокЗначений;
	СписокМеню.Добавить(1, "Без оповещения при ожидании");
	СписокМеню.Добавить(2, "С оповещением при ожидании");
	
	ВыбЗначение = Ждать ВыбратьИзМенюАсинх(СписокМеню, Элементы.СписокНаПодключениеЗакрытьЧат);
	
	Если ВыбЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	БезОповещения = ?(ВыбЗначение.Значение = 1, Истина, Ложь);
	

	Ответ = Ждать ВопросАсинх("Закрыть чат без оповещения?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да,, КодВозвратаДиалога.Нет);
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.СписокНаПодключение.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗакрытьЧатНаСервере(ТекущаяСтрока.Чат, ТекущаяСтрока.Оператор, БезОповещения);
	
	Элементы.СписокНаПодключение.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтправитьВОчередьНаСервере(Чат, БезОповещения)
	
	НачатьТранзакцию();
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.iga_ОчередьРаспределения");
	ЭлементБлокировки.УстановитьЗначение("Чат", Чат);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	БлокировкаДанных.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ОчередьРаспределения.Чат КАК Чат,
	               |	iga_ОчередьРаспределения.Оператор КАК Оператор
	               |ИЗ
	               |	РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	               |ГДЕ
	               |	iga_ОчередьРаспределения.Чат = &Чат";
	Запрос.УстановитьПараметр("Чат", Чат);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Запись = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
		Запись.Чат = Чат;
		Запись.Оператор = Выборка.Оператор;
		Запись.Статус = Перечисления.iga_СтатусыОчереди.Завершен;
		Запись.Записать();
	КонецЕсли;        
	
	Запись = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
	Запись.Чат = Чат;
	Запись.Статус = Перечисления.iga_СтатусыОчереди.Ожидание;
	Запись.ДатаПоступления = НачалоДня(ТекущаяДата());
	Запись.Записать();
	
	iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(Чат, "БезОповещения", БезОповещения);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОтправитьВОчередь(Команда)
	
	СписокМеню = Новый СписокЗначений;
	СписокМеню.Добавить(1, "Без оповещения при ожидании");
	СписокМеню.Добавить(2, "С оповещением при ожидании");
	
	ВыбЗначение = Ждать ВыбратьИзМенюАсинх(СписокМеню, Элементы.ОтправитьВОчередь);
	
	Если ВыбЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	БезОповещения = ?(ВыбЗначение.Значение = 1, Истина, Ложь);
	
	Ответ = Ждать ВопросАсинх("Отправить чат в очередь?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да,, КодВозвратаДиалога.Нет);
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.СписокНаПодключение.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ОтправитьВОчередьНаСервере(ТекущаяСтрока.Чат, БезОповещения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПродолжительностьСтрокой(Знач ДатаНачала, Знач ДатаОкончания, Знач Разница = Ложь) Экспорт
    
    // Проверка на заполненность дат и на то, что ДатаНачала > ДатаОкончания
    Если (Не ЗначениеЗаполнено(ДатаНачала) 
        Или Не ЗначениеЗаполнено(ДатаОкончания) 
        Или ДатаНачала >= ДатаОкончания) И Не Разница Тогда
        Возврат "0 м.";
	КонецЕсли;
	
	Если Разница Тогда
		Если ДатаНачала > ДатаОкончания Тогда
			Дата = ДатаОкончания;
			ДатаОкончания = ДатаНачала;
			ДатаНачала = Дата;
		КонецЕсли;
	КонецЕсли;
    
    // В 1С разница дат возвращается в секундах
    РазницаВСекундах = ДатаОкончания - ДатаНачала;
    
    // Вычисляем составляющие времени
    Дни     = Цел(РазницаВСекундах / 86400);
    Остаток = РазницаВСекундах % 86400;
    
    Часы    = Цел(Остаток / 3600);
    Остаток = Остаток % 3600;
    
    Минуты  = Цел(Остаток / 60);
    Секунды = Остаток % 60;
    
    // Формируем результирующую строку
    МассивСтрок = Новый Массив;
    
    Если Дни > 0 Тогда
        МассивСтрок.Добавить(Формат(Дни, "ЧГ=") + " д.");
    КонецЕсли;
    
    Если Часы > 0 Тогда
        МассивСтрок.Добавить(Формат(Часы, "ЧГ=") + " ч.");
    КонецЕсли;
    
    Если Минуты > 0 Тогда
        МассивСтрок.Добавить(Формат(Минуты, "ЧГ=") + " м.");
    КонецЕсли;
    
    Если Секунды > 0 Тогда
        МассивСтрок.Добавить(Формат(Секунды, "ЧГ=") + " с.");
    КонецЕсли;
    
    // Если разница составила меньше секунды (что в рамках 1С маловероятно при обычных датах, 
    // но возможно при работе с миллисекундами) или что-то пошло не так
    Если МассивСтрок.Количество() = 0 Тогда
        Возврат "0 м.";
    КонецЕсли;
    
    // Соединяем элементы массива через пробел
    Возврат СтрСоединить(МассивСтрок, " ");
    
КонецФункции

&НаСервереБезКонтекста
Процедура СписокНаПодключениеПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
    Для Каждого КлючИЗначение Из Строки Цикл
        
        ДанныеСтроки = КлючИЗначение.Значение.Данные;
        
        ДанныеСтроки.ВремениСПоследнегоОтветаОператора = ПолучитьПродолжительностьСтрокой(ДанныеСтроки.ДатаПоследнегоИсходящего, ТекущаяДата());
        ДанныеСтроки.ВремяСПоследнегоСообщенияПользователя = ПолучитьПродолжительностьСтрокой(ДанныеСтроки.ДатаПоследнегоВходящего, ТекущаяДата());
        ДанныеСтроки.РазницаМеждуСообщениями = ПолучитьПродолжительностьСтрокой(ДанныеСтроки.ДатаПоследнегоИсходящего, ДанныеСтроки.ДатаПоследнегоВходящего, Истина);
        
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийЧат = Параметры.Чат;
	ИдЧата = ТекущийЧат.Идентификатор;
	
КонецПроцедуры
